app/views/photos/show.html.erb


									<span class="meta__author"><%= p.user.first_name %>&nbsp;<%= p.user.last_name %><br><%= p.created_at.strftime("%B %d %Y") %></span>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]